app/Controllers/User.php

    public function detail($nama)
    {
        $userModel = new ContohUser();
        $data =
            [
                'page' => "user",
                'nama' => "User",
                'list2' => $userModel->where(['nama' => $nama])->first()
            ];
---
SELECT *
FROM `users`
WHERE `nama` LIKE '%lala%' ESCAPE '!'
 LIMIT 10
SELECT COUNT(*) AS `numrows`
FROM `users`
WHERE `nama` LIKE '%lala%' ESCAPE '!'
SELECT *
FROM `users`
WHERE `nama` = 'Lala Lili'
 LIMIT 1

                'password' => md5($this->request->getVar('password')),
                'avatar' => $namaavatar
            ];
            $this->ContohUser->save($input);
---
INSERT INTO `users` (`nama`, `alamat`, `tempat_lahir`, `tanggal_lahir`, `jenis_kelamin`, `telepon`, `email`, `username`, `avatar`) VALUES ('Lala Lili', 'Ayam Bakar ayem tentrem sunarman', 'Solo', '2021-12-27', 'Perempuan', '081518454684', 'lalalili@gmail.com', 'lalalili', '1653889672_d03aad7a44af76784c1e.jpg')